url_shortener/URLShortener/app/models/shortened_url.rb

  def self.create_short_url(user, long_url)
    ShortenedUrl.create!(user_id: user.id, long_url: long_url, short_url: ShortenedUrl.random_code)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.google.com"], ["short_url", "R5wJzA"], ["user_id", 2], ["created_at", "2018-11-08 01:36:53.103097"], ["updated_at", "2018-11-08 01:36:53.103097"]]

  def self.random_code
    while true
      short_url = SecureRandom.urlsafe_base64(4)
      break unless ShortenedUrl.exists?(short_url: short_url)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "R5wJzA"], ["LIMIT", 1]]